const express = require('express');
const router = express.Router();
const { Filial } = require("../models/filials");


router.get('/', (req, res)=>{


    (async () => {
        // Filial.create({
        //     name: 'Києвський філіал',
        //     about: 'Українській столиці − понад 1500 років. І вже за це її варто відвідати. Більш стародавнього міста (лик Києва) в Україні, Росії, Білорусі немає. Тут можна пройтися найстарішої вулицею Східної Європи − легендарним Андріївським узвозом. Тут підносяться найдавніші східнослов\'янський храм − Софійський собор, і монастир − Печерська Лавра. Тутешні пагорби − такі ж, як і десятки століть тому, а Дніпро також тече неспішно й велично. Історико-культурна спадщина міста унікальна − це близько 2000 пам\'яток археології, архітектури, історії, природи.',
        //     tell: '+380(089)515-07-34',
        //     email: 'wsqeptcj@yomail.info',
        //     img: 'https://skyandmethod.com/wp-content/uploads/2015/03/kiev-aerial-showreel-2015.jpg'
        // });
        //
        // Filial.create({
        //     name: 'Львівський філіал',
        //     about: 'Львів – це місто незліченних можливостей для відпочинку, туризму та насиченої і різноманітної культурної програми. Тут – численні історичні та архітектурні пам’ятки, загадкові та затишні вулички, чарівні та таємничі місця на будь-який смак.\n' +
        //         '\n' +
        //         'Причин відвідати Львів – величезна кількість:\n' +
        //         '\n' +
        //         ' – Старе місто. На перший погляд здається, що одразу роздивитися та оцінити всі вулички просто неможливо.\n' +
        //         '\n' +
        //         ' – Історичні пам’ятки. Храми, музеї, площі, палаци – кожного разу можна знайти щось нове.\n' +
        //         '\n' +
        //         ' – Романтика. Львів – ідеальне місто для побачень та зустрічей закоханих.\n' +
        //         '\n' +
        //         ' – Кава та шоколад. Саме за ними сюди їдуть з усіх куточків країни.\n' +
        //         '\n' +
        //         ' – Хмільні напої. Львів не лише місто кави та солодощів, а й місто пива та настоянок, які тут готують за власним давнім рецептом.\n' +
        //         '\n' +
        //         ' – Колорит. Тепла, дружня та затишна атмосфера, якою так пишається місцеве населення, вабить туристів.\n' +
        //         '\n' +
        //         'У будь-яку пору року у Львові не доведеться сумувати, адже тут так легко відшукати розваги на свій смак яскравим сонячним днем чи навіть у негоду.',
        //     tell: '+380(42)560-28-91',
        //     email: "snwjlusf@zeroe.ml",
        //     img: 'https://cdn.hipwallpaper.com/m/13/79/S9ueYn.jpg'
        // });
        //
        // Filial.create({
        //     name: 'Одеський філіал',
        //     about: 'Для всіх, хто має бажання поринути в незвичайну, загадкову атмосферу театру, пройтися його розкішними залами і коридорами, відвідати музейну експозицію, познайомитися з історією театру, а також, звичайно, зробити фотографії в його інтер\'єрах, запрошуємо відвідати екскурсії.\n' +
        //         '\n' +
        //         'Супроводжувати вас будуть професійні гіди, знавці історії театру, які неодмінно поділяться цікавими та захоплюючими історіями з життя театру.\n' +
        //         '\n' +
        //         'Є можливість проведення екскурсій для іноземних груп, індивідуальних екскурсій, фотосесій (зокрема весільних).',
        //     tell: "+380(684)787-06-96",
        //     email: 'zonfuhwn@supere.ml',
        //     img: 'https://i1.wp.com/limanpravda.com/files/uploads/2019/02/ZHD-bilety-Odessa.jpg?fit=915%2C492&ssl=1'
        // });



        let filial = await Filial.find({});
        res.send(filial)

    })();

});


module.exports = router;
